OpenFOAM/foam9tutorials/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/0/plateRegion/delta.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/plateRegion";
    object      delta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    plateFaces_top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    region0_to_plateRegion_plateFaces
    {
        type            zeroGradient;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
