OpenFOAM/foam9tutorials/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          plateRegion;

faceZones       (plateFaces);

oneD            false;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       yes;

linearNormalCoeffs
{
    thickness       0.001;
}


// ************************************************************************* //
